RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Include/gd32h75e_timer.h
/* BREAK0 input signal enable */
#define TIMER_BREAK0_ENABLE                 ((uint32_t)TIMER_CCHP_BRK0EN)           /*!< BREAK0 input signal enable */
#define TIMER_BREAK0_DISABLE                ((uint32_t)0x00000000U)                 /*!< BREAK0 input signal disable */

/* BREAK0 input signal polarity */
#define TIMER_BREAK0_POLARITY_LOW           ((uint32_t)0x00000000U)                 /*!< BREAK0 input signal polarity is low */
#define TIMER_BREAK0_POLARITY_HIGH          ((uint32_t)TIMER_CCHP_BRK0P)            /*!< BREAK0 input signal polarity is high */

/* BREAK1 input signal enable */
#define TIMER_BREAK1_ENABLE                 ((uint32_t)TIMER_CCHP_BRK1EN)           /*!< BREAK1 input signal enable */
#define TIMER_BREAK1_DISABLE                ((uint32_t)0x00000000U)                 /*!< BREAK1 input signal disable */

/* BREAK1 input signal polarity */
#define TIMER_BREAK1_POLARITY_LOW           ((uint32_t)0x00000000U)                 /*!< BREAK1 input signal polarity is low */
#define TIMER_BREAK1_POLARITY_HIGH          ((uint32_t)TIMER_CCHP_BRK1P)            /*!< BREAK1 input signal polarity is high */

/* BREAK0 input released */
#define TIMER_BREAK0_RELEASE                ((uint32_t)TIMER_CCHP_BRK0REL)          /*!< BREAK0 input is released */
#define TIMER_BREAK0_UNRELEASE              ((uint32_t)0x00000000U)                 /*!< BREAK0 input is unreleased */

/* BREAK1 input released */
#define TIMER_BREAK1_RELEASE                ((uint32_t)TIMER_CCHP_BRK1REL)          /*!< BREAK1 input is released */
#define TIMER_BREAK1_UNRELEASE              ((uint32_t)0x00000000U)                 /*!< BREAK1 input is unreleased */

/* BREAK0 input locked */
#define TIMER_BREAK0_LK_ENABLE              ((uint32_t)TIMER_CCHP_BRK0LK)           /*!< BREAK0 input locked enable */
#define TIMER_BREAK0_LK_DISABLE             ((uint32_t)0x00000000U)                 /*!< BREAK0 input locked disable */

/* BREAK1 input locked */
#define TIMER_BREAK1_LK_ENABLE              ((uint32_t)TIMER_CCHP_BRK1LK)           /*!< BREAK1 input locked enable */
#define TIMER_BREAK1_LK_DISABLE             ((uint32_t)0x00000000U)                 /*!< BREAK1 input locked disable */

/* free complementary channel protection configure */
#define TIMER_FCCHP_STATE_ENABLE            ((uint32_t)TIMER_FCCHP0_FCCHP0EN)       /*!< free complementary channel protection enable */
#define TIMER_FCCHP_STATE_DISABLE           ((uint32_t)0x00000000U)                 /*!< free complementary channel protection disable */

/* TIMER BREAK0/BREAK1 */
#define TIMER_BREAK0                        ((uint16_t)0x0000U)                     /*!< TIMER BREAK0 */
#define TIMER_BREAK1                        ((uint16_t)0x0001U)                     /*!< TIMER BREAK1 */

/* TIMER break input enable */
#define TIMER_BRKIN0                        TIMER_AFCTL0_BRK0IN0EN                  /*!< BREAKx BRKIN0 alternate function input enable */
#define TIMER_BRKIN1                        TIMER_AFCTL0_BRK0IN1EN                  /*!< BREAKx BRKIN1 alternate function input enable */
#define TIMER_BRKIN2                        TIMER_AFCTL0_BRK0IN2EN                  /*!< BREAKx BRKIN2 alternate function input enable */
#define TIMER_BRKCMP0                       TIMER_AFCTL0_BRK0CMP0EN                 /*!< BREAKx CMP0 input enable */
#define TIMER_BRKCMP1                       TIMER_AFCTL0_BRK0CMP1EN                 /*!< BREAKx CMP1 input enable */
#define TIMER_BRKHPDF                       TIMER_AFCTL0_BRK0HPDFEN                 /*!< BREAKx HPDF input enable */

/* TIMER external break input polarity */
#define TIMER_BRKIN0P                       TIMER_AFCTL0_BRK0IN0P                   /*!< BREAKx BRKIN0 polarity */
#define TIMER_BRKIN1P                       TIMER_AFCTL0_BRK0IN1P                   /*!< BREAKx BRKIN1 polarity */
#define TIMER_BRKIN2P                       TIMER_AFCTL0_BRK0IN2P                   /*!< BREAKx BRKIN2 polarity */
#define TIMER_BRKCMP0P                      TIMER_AFCTL0_BRK0CMP0P                  /*!< BREAKx CMP0 polarity */
#define TIMER_BRKCMP1P                      TIMER_AFCTL0_BRK0CMP1P                  /*!< BREAKx CMP1 polarity */

/* TIMER break external input polarity*/
#define TIMER_BRKIN_POLARITY_LOW            ((uint16_t)0x0000U)                     /*!< TIMER break external input signal will not be inverted */
#define TIMER_BRKIN_POLARITY_HIGH           ((uint16_t)0x0001U)                     /*!< TIMER break external input signal will be inverted */

/* TIMER channel n(n=0,1,2,3) */
#define TIMER_CH_0                          ((uint16_t)0x0000U)                     /*!< TIMER channel 0 */
#define TIMER_CH_1                          ((uint16_t)0x0001U)                     /*!< TIMER channel 1 */
#define TIMER_CH_2                          ((uint16_t)0x0002U)                     /*!< TIMER channel 2 */
#define TIMER_CH_3                          ((uint16_t)0x0003U)                     /*!< TIMER channel 3 */
#define TIMER_MCH_0                         ((uint16_t)0x0010U)                     /*!< TIMER multi mode channel 0 */
#define TIMER_MCH_1                         ((uint16_t)0x0011U)                     /*!< TIMER multi mode channel 1 */
#define TIMER_MCH_2                         ((uint16_t)0x0012U)                     /*!< TIMER multi mode channel 2 */
#define TIMER_MCH_3                         ((uint16_t)0x0013U)                     /*!< TIMER multi mode channel 3 */

/* channel enable state */
#define TIMER_CCX_ENABLE                    ((uint16_t)0x0001U)                     /*!< channel enable */
#define TIMER_CCX_DISABLE                   ((uint16_t)0x0000U)                     /*!< channel disable */

/* channel complementary output enable state */
#define TIMER_CCXN_ENABLE                   ((uint16_t)0x0004U)                     /*!< channel complementary enable */
#define TIMER_CCXN_DISABLE                  ((uint16_t)0x0000U)                     /*!< channel complementary disable */

/* multi mode channel enable state */
#define TIMER_MCCX_ENABLE                   ((uint16_t)0x0004U)                     /*!< multi mode channel enable */
#define TIMER_MCCX_DISABLE                  ((uint16_t)0x0000U)                     /*!< multi mode channel disable */

