RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Include/gd32h75e_timer.h
/* multi mode channel input capture polarity */
#define TIMER_IMC_POLARITY_RISING           ((uint16_t)0x0000U)                     /*!< multi mode channel input capture rising edge */
#define TIMER_IMC_POLARITY_FALLING          ((uint16_t)0x0001U)                     /*!< multi mode channel input capture falling edge */
#define TIMER_IMC_POLARITY_BOTH_EDGE        ((uint16_t)0x0003U)                     /*!< multi mode channel input capture both edge */

/* channel output polarity */
#define TIMER_OC_MCH_POLARITY_HIGH          ((uint16_t)0x0000U)                     /*!< channel output polarity is high */
#define TIMER_OC_MCH_POLARITY_LOW           ((uint16_t)0x0001U)                     /*!< channel output polarity is low */

/* TIMER multi mode channel mode selection */
#define TIMER_MCH_MODE_INDEPENDENTLY        ((uint16_t)0x0000U)                     /*!< multi mode channel work in independently mode */
#define TIMER_MCH_MODE_COMPLEMENTARY        ((uint16_t)0x0003U)                     /*!< multi mode channel work in complementary output mode */
#define TIMER_MCH_MODE_MASK                 ((uint16_t)0x0003U)                     /*!< multi mode channel mode mask */

/* parameter check definitions */
#ifdef FW_DEBUG_ERR_REPORT

/* check the timer periph */
#define NOT_TIMER_PERIPH(timer_periph)       (((timer_periph) != TIMER0) && ((timer_periph) != TIMER1) && ((timer_periph) != TIMER2) && ((timer_periph) != TIMER3) && ((timer_periph) != TIMER4) && ((timer_periph) != TIMER5) && ((timer_periph) != TIMER6) && ((timer_periph) != TIMER7) && \
                                             ((timer_periph) != TIMER14) && ((timer_periph) != TIMER15) && ((timer_periph) != TIMER16) && ((timer_periph) != TIMER22) && ((timer_periph) != TIMER23) && \
                                             ((timer_periph) != TIMER40) && ((timer_periph) != TIMER41) && ((timer_periph) != TIMER42) && ((timer_periph) != TIMER43) && ((timer_periph) != TIMER44) && \
                                             ((timer_periph) != TIMER50) && ((timer_periph) != TIMER51))

/* check the timer alligned mode */
#define NOT_TIMER_ALIGNED(aligned)           (((aligned) != TIMER_COUNTER_EDGE) && ((aligned) != TIMER_COUNTER_CENTER_DOWN) && \
                                             ((aligned) != TIMER_COUNTER_CENTER_UP) && ((aligned) != TIMER_COUNTER_CENTER_BOTH))

/* check the timer psc reload selection*/
#define NOT_TIMER_PSCRELOAD(pscreload)       (((pscreload) != TIMER_PSC_RELOAD_NOW) && ((pscreload) != TIMER_PSC_RELOAD_UPDATE))

/* check the timer repetition register */
#define NOT_TIMER_CREP_CCSEL(ccsel)          (((ccsel) != TIMER_CREP0_ENABLE) && ((ccsel) != TIMER_CREP1_ENABLE))

/* check the timer single pulse mode */
#define NOT_TIMER_SPMODE(spmode)             (((spmode) != TIMER_SP_MODE_SINGLE) && ((spmode) != TIMER_SP_MODE_REPETITIVE))

/* check the timer channel parameter */
#define NOT_TIMER_ALL_CHANNEL(channel)       (((channel) != TIMER_CH_0) && ((channel) != TIMER_CH_1) && ((channel) != TIMER_CH_2) && ((channel) != TIMER_CH_3) && \
                                             ((channel) != TIMER_MCH_0) && ((channel) != TIMER_MCH_1) && ((channel) != TIMER_MCH_2) && ((channel) != TIMER_MCH_3))

#define NOT_TIMER_CHANNEL(channel)           (((channel) != TIMER_CH_0) && ((channel) != TIMER_CH_1) && \
                                             ((channel) != TIMER_CH_2) && ((channel) != TIMER_CH_3))

/* check the timer delayable single pulse mode */
#define NOT_TIMER_DSPMODE(dspmode)           (((dspmode) != TIMER_OC_MODE_DSPM0) && ((dspmode) != TIMER_OC_MODE_DSPM1))

/* check the timer counter direction selection */
#define NOT_TIMER_CNT_DIR(cnt_dir)           (((cnt_dir) != TIMER_COUNTER_UP) && ((cnt_dir) != TIMER_COUNTER_DOWN))

/* check the timer update event selection for shadow register */
#define NOT_TIMER_UPDATE(update)             (((update) != TIMER_UPDATE_SRC_GLOBAL) && ((update) != TIMER_UPDATE_SRC_REGULAR))

/* check the timer dma enable selection */
#define NOT_TIMER_DMA(dma)                   (((dma) & 0x0F007F00U) == 0x00000000U)

/* check the timer dma request selection */
#define NOT_TIMER_DMA_REQUEST(dma_request)    (((dma_request) != TIMER_DMAREQUEST_UPDATEEVENT)  && ((dma_request) != TIMER_DMAREQUEST_CHANNELEVENT))

/* check the timer dma base address */
#define NOT_TIMER_DMA_BASEADDR(dma_baseaddr)  (((dma_baseaddr) != TIMER_DMACFG_DMATA_CTL0)       && ((dma_baseaddr) != TIMER_DMACFG_DMATA_CTL1) && \
                                              ((dma_baseaddr) != TIMER_DMACFG_DMATA_SMCFG)       && ((dma_baseaddr) != TIMER_DMACFG_DMATA_DMAINTEN) && \
                                              ((dma_baseaddr) != TIMER_DMACFG_DMATA_INTF)        && ((dma_baseaddr) != TIMER_DMACFG_DMATA_SWEVG) && \
                                              ((dma_baseaddr) != TIMER_DMACFG_DMATA_CHCTL0)      && ((dma_baseaddr) != TIMER_DMACFG_DMATA_CHCTL1) && \
                                              ((dma_baseaddr) != TIMER_DMACFG_DMATA_CHCTL2)      && ((dma_baseaddr) != TIMER_DMACFG_DMATA_CNT) && \
                                              ((dma_baseaddr) != TIMER_DMACFG_DMATA_PSC)         && ((dma_baseaddr) != TIMER_DMACFG_DMATA_CAR) && \
                                              ((dma_baseaddr) != TIMER_DMACFG_DMATA_CREP0)       && ((dma_baseaddr) != TIMER_DMACFG_DMATA_CH0CV) && \
                                              ((dma_baseaddr) != TIMER_DMACFG_DMATA_CH1CV)       && ((dma_baseaddr) != TIMER_DMACFG_DMATA_CH2CV) && \
                                              ((dma_baseaddr) != TIMER_DMACFG_DMATA_CH3CV)       && ((dma_baseaddr) != TIMER_DMACFG_DMATA_CCHP) && \
                                              ((dma_baseaddr) != TIMER_DMACFG_DMATA_MCHCTL0)     && ((dma_baseaddr) != TIMER_DMACFG_DMATA_MCHCTL1) && \
                                              ((dma_baseaddr) != TIMER_DMACFG_DMATA_MCHCTL2)     && ((dma_baseaddr) != TIMER_DMACFG_DMATA_MCH0CV) && \
                                              ((dma_baseaddr) != TIMER_DMACFG_DMATA_MCH1CV)      && ((dma_baseaddr) != TIMER_DMACFG_DMATA_MCH2CV) && \
                                              ((dma_baseaddr) != TIMER_DMACFG_DMATA_MCH3CV)      && ((dma_baseaddr) != TIMER_DMACFG_DMATA_CH0COMV_ADD) && \
                                              ((dma_baseaddr) != TIMER_DMACFG_DMATA_CH1COMV_ADD) && ((dma_baseaddr) != TIMER_DMACFG_DMATA_CH2COMV_ADD) && \
                                              ((dma_baseaddr) != TIMER_DMACFG_DMATA_CH3COMV_ADD) && ((dma_baseaddr) != TIMER_DMACFG_DMATA_CTL2) && \
                                              ((dma_baseaddr) != TIMER_DMACFG_DMATA_FCCHP0)      && ((dma_baseaddr) != TIMER_DMACFG_DMATA_FCCHP1) && \
                                              ((dma_baseaddr) != TIMER_DMACFG_DMATA_FCCHP2)      && ((dma_baseaddr) != TIMER_DMACFG_DMATA_FCCHP3) && \
                                              ((dma_baseaddr) != TIMER_DMACFG_DMATA_AFCTL0)      && ((dma_baseaddr) != TIMER_DMACFG_DMATA_AFCTL1) && \
                                              ((dma_baseaddr) != TIMER_DMACFG_DMATA_WDGPER)      && ((dma_baseaddr) != TIMER_DMACFG_DMATA_CREP1))

