RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Include/gd32h75e_timer.h
/* check the DMA length value */
#define TIMER_DMA_LENGTH_HIGH_VALUE           ((uint32_t)0x00000025U)
#define NOT_TIMER_DMA_LENGTH(dma_lenth)       ((((dma_lenth) & (~(BITS(8,13))))!= (uint32_t)0U) || (TIMER_DMA_LENGTH_HIGH_VALUE < ((dma_lenth)>>8))) 

/* check the timer software event generation source */
#define NOT_TIMER_EVENT(event)                (((event) & 0xF0F001FFU) == 0x00000000U)

/* check the timer break number */
#define NOT_TIMER_BREAK_NUM(break_num)        (((break_num) != TIMER_BREAK0)  && ((break_num) != TIMER_BREAK1))

/* check the timer channel control shadow register update control mode */
#define NOT_TIMER_CCUC(ccuctl)                (((ccuctl) != TIMER_UPDATECTL_CCU) && ((ccuctl) != TIMER_UPDATECTL_CCUTRI) && \
                                              ((ccuctl) != TIMER_UPDATECTL_CCUOVER) && ((ccuctl) != TIMER_UPDATECTL_CCUUNDER) && \
                                              ((ccuctl) != TIMER_UPDATECTL_CCUOVERUNDER))

/* check the timer output mode parameter */
#define NOT_TIMER_OCMODE(ocmode)              (((ocmode) != TIMER_OC_MODE_TIMING)    && ((ocmode) != TIMER_OC_MODE_ACTIVE) && \
                                              ((ocmode) != TIMER_OC_MODE_INACTIVE)  && ((ocmode) != TIMER_OC_MODE_TOGGLE) && \
                                              ((ocmode) != TIMER_OC_MODE_LOW)       && ((ocmode) != TIMER_OC_MODE_HIGH) && \
                                              ((ocmode) != TIMER_OC_MODE_PWM0)      && ((ocmode) != TIMER_OC_MODE_PWM1) && \
                                              ((ocmode) != TIMER_OC_MODE_DSPM0) && ((ocmode) != TIMER_OC_MODE_DSPM1))

/* check the timer channel output compare shadow enable parameter */
#define NOT_TIMER_OCSHADOW(ocshadow)          (((ocshadow) != TIMER_OC_SHADOW_ENABLE) && ((ocshadow) != TIMER_OC_SHADOW_DISABLE) && \
                                              ((ocshadow) != TIMER_OMC_SHADOW_ENABLE) && ((ocshadow) != TIMER_OMC_SHADOW_DISABLE))

/* check the timer channel output compare clear enable parameter */
#define NOT_TIMER_OCCLEAR(occlear)                         (((occlear) != TIMER_OC_CLEAR_ENABLE) && ((occlear) != TIMER_OC_CLEAR_DISABLE) && \
                                                           ((occlear) != TIMER_OMC_CLEAR_ENABLE) && ((occlear) != TIMER_OMC_CLEAR_DISABLE))

/* check the timer channel output compare polarity parameter */
#define NOT_TIMER_CHANNEL_OCPOLARITY(ocpolarity)           (((ocpolarity) != TIMER_OC_POLARITY_HIGH) && ((ocpolarity) != TIMER_OC_POLARITY_LOW) && \
                                                           ((ocpolarity) != TIMER_OMC_POLARITY_HIGH) && ((ocpolarity) != TIMER_OMC_POLARITY_LOW))

#define NOT_TIMER_OCNPOLARITY(ocnpolarity)                 (((ocnpolarity) != TIMER_OCN_POLARITY_HIGH) && ((ocnpolarity) != TIMER_OCN_POLARITY_LOW))

/* check the timer channel state parameter */
#define NOT_TIMER_CHANNEL_STATE(state)                     (((state) != TIMER_CCX_ENABLE)   && ((state) != TIMER_CCX_DISABLE) && \
                                                           ((state) != TIMER_MCCX_ENABLE)  && ((state) != TIMER_MCCX_DISABLE))

#define NOT_TIMER_OUTPUTNSTATE(outputnstate)               (((outputnstate) != TIMER_CCXN_ENABLE) && ((outputnstate) != TIMER_CCXN_DISABLE))

/* check the timer input capture prescaler parameter */
#define NOT_TIMER_ICPRESCALER(icprescaler)                 (((icprescaler) != TIMER_IC_PSC_DIV1) && ((icprescaler) != TIMER_IC_PSC_DIV2) && \
                                                           ((icprescaler) != TIMER_IC_PSC_DIV4) && ((icprescaler) != TIMER_IC_PSC_DIV8))

/* check the hall mode enable parameter */
#define NOT_TIMER_HALL_MODE(hallmode)                      (((hallmode) != TIMER_HALLINTERFACE_ENABLE)  && ((hallmode) != TIMER_HALLINTERFACE_DISABLE))

/* check the multi channel parameter */
#define NOT_TIMER_MULTI_CHANNEL(channel)                               (((channel) != TIMER_MCH_0) && ((channel) != TIMER_MCH_1) && \
                                                                       ((channel) != TIMER_MCH_2) && ((channel) != TIMER_MCH_3))

/* check the multi channel output mode parameter */
#define NOT_TIMER_MULTI_MODE_CHANNEL_OUTPUT_MODE(multi_mode_sel)           (((multi_mode_sel) != TIMER_MCH_MODE_INDEPENDENTLY) && ((multi_mode_sel) != TIMER_MCH_MODE_COMPLEMENTARY))

/* check the timer input trigger source parameter */
#define NOT_TIMER_INPUT_TRIGGER_SOURCE(intrigger)          (((intrigger) != TIMER_SMCFG_TRGSEL_NONE) && ((intrigger) != TIMER_SMCFG_TRGSEL_ITI0) && \
                                                           ((intrigger) != TIMER_SMCFG_TRGSEL_ITI1) && ((intrigger) != TIMER_SMCFG_TRGSEL_ITI2) && \
                                                           ((intrigger) != TIMER_SMCFG_TRGSEL_ITI3) && ((intrigger) != TIMER_SMCFG_TRGSEL_CI0F_ED) && \
                                                           ((intrigger) != TIMER_SMCFG_TRGSEL_CI0FE0) && ((intrigger) != TIMER_SMCFG_TRGSEL_CI1FE1) && \
                                                           ((intrigger) != TIMER_SMCFG_TRGSEL_ETIFP) && ((intrigger) != TIMER_SMCFG_TRGSEL_CI2FE2) && \
                                                           ((intrigger) != TIMER_SMCFG_TRGSEL_CI3FE3) && ((intrigger) != TIMER_SMCFG_TRGSEL_MCI0FEM0) && \
                                                           ((intrigger) != TIMER_SMCFG_TRGSEL_MCI1FEM1) && ((intrigger) != TIMER_SMCFG_TRGSEL_MCI2FEM2) && \
                                                           ((intrigger) != TIMER_SMCFG_TRGSEL_MCI3FEM3) && ((intrigger) != TIMER_SMCFG_TRGSEL_ITI12) && \
                                                           ((intrigger) != TIMER_SMCFG_TRGSEL_ITI13) && ((intrigger) != TIMER_SMCFG_TRGSEL_ITI14) && \
                                                           ((intrigger) != TIMER_L0_SMCFG_TRGSEL_ITI4) && ((intrigger) != TIMER_L0_SMCFG_TRGSEL_ITI5) && \
                                                           ((intrigger) != TIMER_L0_SMCFG_TRGSEL_ITI7) && ((intrigger) != TIMER_L0_SMCFG_TRGSEL_ITI9) && \
                                                           ((intrigger) != TIMER_L0_SMCFG_TRGSEL_ITI10) && ((intrigger) != TIMER_L0_SMCFG_TRGSEL_ITI11))

/* check the timer output trigger source parameter */
#define NOT_TIMER_OUTPUT0_TRIGGER_SOURCE(outtrigger)        (((outtrigger) != TIMER_TRI_OUT0_SRC_RESET) && ((outtrigger) != TIMER_TRI_OUT0_SRC_ENABLE) && \
                                                           ((outtrigger) != TIMER_TRI_OUT0_SRC_UPDATE) && ((outtrigger) != TIMER_TRI_OUT0_SRC_CH0) && \
                                                           ((outtrigger) != TIMER_TRI_OUT0_SRC_O0CPRE) && ((outtrigger) != TIMER_TRI_OUT0_SRC_O1CPRE) && \
                                                           ((outtrigger) != TIMER_TRI_OUT0_SRC_O2CPRE) && ((outtrigger) != TIMER_TRI_OUT0_SRC_O3CPRE))

#define NOT_TIMER_OUTPUT1_TRIGGER_SOURCE(outtrigger)        (((outtrigger) != TIMER_TRI_OUT1_SRC_RESET) && ((outtrigger) != TIMER_TRI_OUT1_SRC_ENABLE) && \
                                                           ((outtrigger) != TIMER_TRI_OUT1_SRC_UPDATE) && ((outtrigger) != TIMER_TRI_OUT1_SRC_CH0) && \
                                                           ((outtrigger) != TIMER_TRI_OUT1_SRC_O0CPRE) && ((outtrigger) != TIMER_TRI_OUT1_SRC_O1CPRE) && \
                                                           ((outtrigger) != TIMER_TRI_OUT1_SRC_O2CPRE) && ((outtrigger) != TIMER_TRI_OUT1_SRC_O3CPRE))

/* check the timer slave select parameter */
#define NOT_TIMER_SLAVE_MODE_SELECT(slavemode)             (((slavemode) != TIMER_QUAD_DECODER_MODE0)      && ((slavemode) != TIMER_QUAD_DECODER_MODE1) && \
                                                           ((slavemode) != TIMER_QUAD_DECODER_MODE2)       && ((slavemode) != TIMER_SLAVE_MODE_RESTART) && \
                                                           ((slavemode) != TIMER_SLAVE_MODE_PAUSE)         && ((slavemode) != TIMER_SLAVE_MODE_EVENT) && \
                                                           ((slavemode) != TIMER_SLAVE_MODE_EXTERNAL0)     && ((slavemode) != TIMER_SLAVE_MODE_RESTART_EVENT) && \
                                                           ((slavemode) != TIMER_NONQUAD_DECODER_MODE0)    && ((slavemode) != TIMER_NONQUAD_DECODER_MODE1) && \
                                                           ((slavemode) != TIMER_SLAVE_MODE_DISABLE))

/* check the timer master slave mode parameter */
#define NOT_TIMER_MASTER_SLAVE_MODE(masterslave)           (((masterslave) != TIMER_MASTER_SLAVE_MODE_ENABLE)  && ((masterslave) != TIMER_MASTER_SLAVE_MODE_DISABLE))

/* check the timer extern trigger prescaler parameter */
#define NOT_TIMER_EXT_TRI_PSC(extprescaler)                (((extprescaler) != TIMER_EXT_TRI_PSC_OFF)  && ((extprescaler) != TIMER_EXT_TRI_PSC_DIV2) && \
                                                           ((extprescaler) != TIMER_EXT_TRI_PSC_DIV4) && ((extprescaler) != TIMER_EXT_TRI_PSC_DIV8))

/* check the timer extern trigger polarity parameter */
#define NOT_TIMER_EXTPOLARITY(extpolarity)                 (((extpolarity) != TIMER_ETP_FALLING) && ((extpolarity) != TIMER_ETP_RISING))

/* check the extern trigger filter value */
#define TIMER_CHANNEL_EXTFILTER_HIGH_VALUE                 ((uint32_t)0x0000000FU)        /*!< maximum filter value */
#define NOT_TIMER_CHANNEL_EXTFILTER(extfilter)             (TIMER_CHANNEL_EXTFILTER_HIGH_VALUE < (extfilter))

/* check the quadrature decoder mode parameter */
#define NOT_TIMER_QUAD_DECODER(decomode)                   (((decomode) != TIMER_QUAD_DECODER_MODE0) && ((decomode) != TIMER_QUAD_DECODER_MODE1) && \
                                                           ((decomode) != TIMER_QUAD_DECODER_MODE2))

/* check the timer input capture polarity */
#define NOT_TIMER_ICPOLARITY(icpolarity)                   (((icpolarity) != TIMER_IC_POLARITY_RISING)    && ((icpolarity) != TIMER_IC_POLARITY_FALLING) && \
                                                           ((icpolarity) != TIMER_IC_POLARITY_BOTH_EDGE))

/* check the non-quadrature decoder mode parameter */
#define NOT_TIMER_NONQUAD_DECODER(decomode)                (((decomode) != TIMER_NONQUAD_DECODER_MODE0) && ((decomode) != TIMER_NONQUAD_DECODER_MODE1))

/* check the timer internal trigger selection parameter */
#define NOT_TIMER_INTRIGGER(intrigger)                     (((intrigger) != TIMER_SMCFG_TRGSEL_ITI0) && ((intrigger) != TIMER_SMCFG_TRGSEL_ITI1) && \
                                                           ((intrigger) != TIMER_SMCFG_TRGSEL_ITI2) && ((intrigger) != TIMER_SMCFG_TRGSEL_ITI3) && \
                                                           ((intrigger) != TIMER_L0_SMCFG_TRGSEL_ITI4) && ((intrigger) != TIMER_L0_SMCFG_TRGSEL_ITI5) && \
                                                           ((intrigger) != TIMER_L0_SMCFG_TRGSEL_ITI7) && ((intrigger) != TIMER_L0_SMCFG_TRGSEL_ITI9) && \
                                                           ((intrigger) != TIMER_L0_SMCFG_TRGSEL_ITI10) && ((intrigger) != TIMER_L0_SMCFG_TRGSEL_ITI11) && \
                                                           ((intrigger) != TIMER_SMCFG_TRGSEL_ITI12) && ((intrigger) != TIMER_SMCFG_TRGSEL_ITI13) && ((intrigger) != TIMER_SMCFG_TRGSEL_ITI14))

