RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Include/gd32h75e_timer.h
/* check the timer external trigger selection parameter */
#define NOT_TIMER_EXTRIGGER(extrigger)                     (((extrigger) != TIMER_SMCFG_TRGSEL_CI0F_ED) && ((extrigger) != TIMER_SMCFG_TRGSEL_CI0FE0) && \
                                                           ((extrigger) != TIMER_SMCFG_TRGSEL_CI1FE1) && ((extrigger) != TIMER_SMCFG_TRGSEL_CI2FE2) && \
                                                           ((extrigger) != TIMER_SMCFG_TRGSEL_CI3FE3) && ((extrigger) != TIMER_SMCFG_TRGSEL_MCI0FEM0) && \
                                                           ((extrigger) != TIMER_SMCFG_TRGSEL_MCI1FEM1) && ((extrigger) != TIMER_SMCFG_TRGSEL_MCI2FEM2) && \
                                                           ((extrigger) != TIMER_SMCFG_TRGSEL_MCI3FEM3))

/* check the timer chxcv register selection parameter */
#define NOT_TIMER_CHVSEL_CCSEL(ccsel)                      (((ccsel) != TIMER_CHVSEL_DISABLE) && ((ccsel) != TIMER_CHVSEL_ENABLE))

/* check the timer output value selection parameter */
#define NOT_TIMER_OUTSEL(outsel)                           (((outsel) != TIMER_OUTSEL_DISABLE) && ((outsel) != TIMER_OUTSEL_ENABLE))

/* check the timer commutation control shadow register selection */
#define NOT_TIMER_CCUSEL_CCSSEL(ccssel)                    (((ccssel) != TIMER_CCUSEL_DISABLE) && ((ccssel) != TIMER_CCUSEL_ENABLE))

/* check the timer output match pulse selection parameter */
#define NOT_TIMER_PLUSE_OUTPUT(pulsesel)                   (((pulsesel) != TIMER_PULSE_OUTPUT_NORMAL)   && ((pulsesel) != TIMER_PULSE_OUTPUT_CNT_UP) && \
                                                           ((pulsesel) != TIMER_PULSE_OUTPUT_CNT_DOWN) && ((pulsesel) != TIMER_PULSE_OUTPUT_CNT_BOTH))

/* check the timer channel additional output compare shadow enable parameter */
#define NOT_TIMER_ADD_SHADOW(aocshadow)                    (((aocshadow) != TIMER_ADD_SHADOW_ENABLE)  && ((aocshadow) != TIMER_ADD_SHADOW_DISABLE))


/* check the timer break source */
#define NOT_TIMER_BREAK_SRC(break_src)                     (((break_src) != TIMER_BRKIN0)   && ((break_src) != TIMER_BRKIN1) && \
                                                           ((break_src) != TIMER_BRKIN2) && ((break_src) != TIMER_BRKCMP0) && \
                                                           ((break_src) != TIMER_BRKCMP1) && ((break_src) != TIMER_BRKHPDF))

/* check the timer break polarity */
#define NOT_TIMER_BKINPOLARITY(bkinpolarity)               (((bkinpolarity) != TIMER_BRKIN_POLARITY_LOW) && ((bkinpolarity) != TIMER_BRKIN_POLARITY_HIGH))

/* check the timer flag parameter */
#define NOT_TIMER_FLAG(flag)                               (((flag) != TIMER_FLAG_UP)        && ((flag) != TIMER_FLAG_CH0) && \
                                                           ((flag) != TIMER_FLAG_CH1)        && ((flag) != TIMER_FLAG_CH2) && \
                                                           ((flag) != TIMER_FLAG_CH3)        && ((flag) != TIMER_FLAG_CMT) && \
                                                           ((flag) != TIMER_FLAG_TRG)        && ((flag) != TIMER_FLAG_BRK0) && ((flag) != TIMER_FLAG_BRK1) && \
                                                           ((flag) != TIMER_FLAG_CH0O)       && ((flag) != TIMER_FLAG_CH1O) && \
                                                           ((flag) != TIMER_FLAG_CH2O)       && ((flag) != TIMER_FLAG_CH3O) && \
                                                           ((flag) != TIMER_FLAG_SYSB)       && ((flag) != TIMER_FLAG_MCH0) && ((flag) != TIMER_FLAG_DECJ) && ((flag) != TIMER_FLAG_DECDIS) && \
                                                           ((flag) != TIMER_FLAG_MCH1)       && ((flag) != TIMER_FLAG_MCH2) && \
                                                           ((flag) != TIMER_FLAG_MCH3)       && ((flag) != TIMER_FLAG_MCH0O) && \
                                                           ((flag) != TIMER_FLAG_MCH1O)      && ((flag) != TIMER_FLAG_MCH2O) && \
                                                           ((flag) != TIMER_FLAG_MCH3O)      && ((flag) != TIMER_FLAG_CH0COMADD) && \
                                                           ((flag) != TIMER_FLAG_CH1COMADD)  && ((flag) != TIMER_FLAG_CH2COMADD) && \
                                                           ((flag) != TIMER_FLAG_CH3COMADD))

/* check the timer interrupt source selction parameter */
#define NOT_TIMER_INTERRUPT(interrupt)                     (((interrupt) != TIMER_INT_UP)        && ((interrupt) != TIMER_INT_CH0) && \
                                                           ((interrupt) != TIMER_INT_CH1)        && ((interrupt) != TIMER_INT_CH2) && \
                                                           ((interrupt) != TIMER_INT_CH3)        && ((interrupt) != TIMER_INT_CMT) && \
                                                           ((interrupt) != TIMER_INT_TRG)        && ((interrupt) != TIMER_INT_BRK) && \
                                                           ((interrupt) != TIMER_INT_MCH0)       && ((interrupt) != TIMER_INT_DECJ) && ((interrupt) != TIMER_INT_DECDIS) && \
                                                           ((interrupt) != TIMER_INT_MCH1)       && ((interrupt) != TIMER_INT_MCH2) && \
                                                           ((interrupt) != TIMER_INT_MCH3)       && ((interrupt) != TIMER_INT_CH0COMADD) && \
                                                           ((interrupt) != TIMER_INT_CH1COMADD)  && ((interrupt) != TIMER_INT_CH2COMADD) && \
                                                           ((interrupt) != TIMER_INT_CH3COMADD))

/* check the timer interrupt flag parameter */
#define NOT_TIMER_INT_FLAG(int_flag)                       (((int_flag) != TIMER_INT_FLAG_UP)        && ((int_flag) != TIMER_INT_FLAG_CH0) && \
                                                           ((int_flag) != TIMER_INT_FLAG_CH1)        && ((int_flag) != TIMER_INT_FLAG_CH2) && \
                                                           ((int_flag) != TIMER_INT_FLAG_CH3)        && ((int_flag) != TIMER_INT_FLAG_CMT) && \
                                                           ((int_flag) != TIMER_INT_FLAG_TRG)        && ((int_flag) != TIMER_INT_FLAG_BRK0) && ((int_flag) != TIMER_INT_FLAG_BRK1) && \
                                                           ((int_flag) != TIMER_INT_FLAG_SYSB)       && ((int_flag) != TIMER_INT_FLAG_DECJ) && \
                                                           ((int_flag) != TIMER_INT_FLAG_DECDIS)     && ((int_flag) != TIMER_INT_FLAG_MCH0) && \
                                                           ((int_flag) != TIMER_INT_FLAG_MCH1)       && ((int_flag) != TIMER_INT_FLAG_MCH2) && \
                                                           ((int_flag) != TIMER_INT_FLAG_MCH3)       && ((int_flag) != TIMER_INT_FLAG_CH0COMADD) && \
                                                           ((int_flag) != TIMER_INT_FLAG_CH1COMADD)  && ((int_flag) != TIMER_INT_FLAG_CH2COMADD) && \
                                                           ((int_flag) != TIMER_INT_FLAG_CH3COMADD))

